In [89]:
#here we add remove rows and columns
Students = {
    
    'firstN':['Apoorv','Aniruddha','Yugant'],
    'lastN' :['Dhavalikar','Dhavalikar','Adhrit'],
    'age' :[23,23,100]
    
}

In [90]:
import pandas as pd
df = pd.DataFrame(Students)
df

      firstN       lastN  age
0     Apoorv  Dhavalikar   23
1  Aniruddha  Dhavalikar   23
2     Yugant      Adhrit  100

In [91]:
# full name :)
df.firstN + " " + df.lastN

0       Apoorv Dhavalikar
1    Aniruddha Dhavalikar
2           Yugant Adhrit
dtype: object

In [92]:
df["firstN"] + " " +  df["lastN"]

0       Apoorv Dhavalikar
1    Aniruddha Dhavalikar
2           Yugant Adhrit
dtype: object

In [93]:
# assign variable to it
fullName = df.firstN + " " + df.lastN
#Add fullname column to dataframe
df["fullN"] = fullName
df

      firstN       lastN  age                 fullN
0     Apoorv  Dhavalikar   23     Apoorv Dhavalikar
1  Aniruddha  Dhavalikar   23  Aniruddha Dhavalikar
2     Yugant      Adhrit  100         Yugant Adhrit

In [94]:
#create fullname using function
def full_Name():
    full_N = df.lastN + " " + df.firstN
    return full_N

In [95]:
df["newName"] = full_Name()
df

      firstN       lastN  age                 fullN               newName
0     Apoorv  Dhavalikar   23     Apoorv Dhavalikar     Dhavalikar Apoorv
1  Aniruddha  Dhavalikar   23  Aniruddha Dhavalikar  Dhavalikar Aniruddha
2     Yugant      Adhrit  100         Yugant Adhrit         Adhrit Yugant

In [96]:
#drop columns
df.drop(columns=["newName"])
df

      firstN       lastN  age                 fullN               newName
0     Apoorv  Dhavalikar   23     Apoorv Dhavalikar     Dhavalikar Apoorv
1  Aniruddha  Dhavalikar   23  Aniruddha Dhavalikar  Dhavalikar Aniruddha
2     Yugant      Adhrit  100         Yugant Adhrit         Adhrit Yugant

In [97]:
df.drop(columns=["newName"],inplace=True)
df

      firstN       lastN  age                 fullN
0     Apoorv  Dhavalikar   23     Apoorv Dhavalikar
1  Aniruddha  Dhavalikar   23  Aniruddha Dhavalikar
2     Yugant      Adhrit  100         Yugant Adhrit

In [98]:
#drop firstN and lastN
df.drop(columns=["firstN","lastN"],inplace=True)
df

   age                 fullN
0   23     Apoorv Dhavalikar
1   23  Aniruddha Dhavalikar
2  100         Yugant Adhrit

In [99]:
df.fullN.str.split(' ')
#split at space

0       [Apoorv, Dhavalikar]
1    [Aniruddha, Dhavalikar]
2           [Yugant, Adhrit]
Name: fullN, dtype: object

In [100]:
df.fullN.str.split(' ',expand=True)
#disply in table format

           0           1
0     Apoorv  Dhavalikar
1  Aniruddha  Dhavalikar
2     Yugant      Adhrit

In [103]:
# add first and last again with above data
df[["first","last"]] = df.fullN.str.split(' ',expand=True)
df

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100         Yugant Adhrit     Yugant      Adhrit

In [104]:
# add values in rows
df.append({"first":"Captain"})
#Error occur because there is no extra index in table

TypeError: Can only append a dict if ignore_index=True

In [105]:
#now ignore index
df.append({"first":"Captain"},ignore_index = True)

     age                 fullN      first        last
0   23.0     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23.0  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100.0         Yugant Adhrit     Yugant      Adhrit
3    NaN                   NaN    Captain         NaN

In [127]:
# create new dataframe
Marvel = {
    
    'first':['Steve',"Tonny"],
    'last' :["Rogers","stark"],
    'fullN' :["Steve Rogers","Tonny stark"],
    'age' :[120,50]
    
}

In [128]:
df2 = pd.DataFrame(Marvel)
df2

   first    last         fullN  age
0  Steve  Rogers  Steve Rogers  120
1  Tonny   stark   Tonny stark   50

In [132]:
#  add two dataframes together
df3=df.append(df2,ignore_index = True,sort = False)

In [133]:
df3

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100         Yugant Adhrit     Yugant      Adhrit
3  120          Steve Rogers      Steve      Rogers
4   50           Tonny stark      Tonny       stark

In [134]:
df3.drop(index=2)

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
3  120          Steve Rogers      Steve      Rogers
4   50           Tonny stark      Tonny       stark

In [138]:
df3.drop(index=df3[df3["age"]==120].index)#here we used .index method and filter

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100         Yugant Adhrit     Yugant      Adhrit
4   50           Tonny stark      Tonny       stark

In [139]:
df3

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100         Yugant Adhrit     Yugant      Adhrit
3  120          Steve Rogers      Steve      Rogers
4   50           Tonny stark      Tonny       stark

In [140]:
df = df3

In [149]:
df

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100         Yugant Adhrit     Yugant      Adhrit
3  120          Steve Rogers      Steve      Rogers
4   50           Tonny stark      Tonny       stark

In [150]:
#sorting Data
df.sort_values(by="first")

   age                 fullN      first        last
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
3  120          Steve Rogers      Steve      Rogers
4   50           Tonny stark      Tonny       stark
2  100         Yugant Adhrit     Yugant      Adhrit

In [151]:
#sorting Data
df.sort_values(by="age",ascending = False)

   age                 fullN      first        last
3  120          Steve Rogers      Steve      Rogers
2  100         Yugant Adhrit     Yugant      Adhrit
4   50           Tonny stark      Tonny       stark
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar

In [152]:
df.sort_values(by=["age","fullN"],ascending = True)
#sort multiple columns

   age                 fullN      first        last
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
4   50           Tonny stark      Tonny       stark
2  100         Yugant Adhrit     Yugant      Adhrit
3  120          Steve Rogers      Steve      Rogers

In [156]:
df.sort_values(by=['age','first'], ascending = [True ,False])
#sort with respective order

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
4   50           Tonny stark      Tonny       stark
2  100         Yugant Adhrit     Yugant      Adhrit
3  120          Steve Rogers      Steve      Rogers

In [158]:
df.sort_index()
#index is sorted

   age                 fullN      first        last
0   23     Apoorv Dhavalikar     Apoorv  Dhavalikar
1   23  Aniruddha Dhavalikar  Aniruddha  Dhavalikar
2  100         Yugant Adhrit     Yugant      Adhrit
3  120          Steve Rogers      Steve      Rogers
4   50           Tonny stark      Tonny       stark

In [159]:
df.age.nlargest(2)
# first two largest ages

3    120
2    100
Name: age, dtype: int64